IRP/src/InformationRegisters/T9011S_AccountsCashAccount/T9011S_AccountsCashAccount.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9011S_AccountsCashAccount</name>
 <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
 <resources>
  <name>Account</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountTransit</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LedgerTypeVariant</name>
  <type>
   <types>CatalogRef.LedgerTypeVariants</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CashAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/CashAccountTypes/CashAccountTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CashAccountTypes</name>
 <enumValues>
  <name>Bank</name>
 </enumValues>
 <enumValues>
  <name>Cash</name>
 </enumValues>
 <enumValues>
  <name>Transit</name>
 </enumValues>
 <enumValues>
  <name>POS</name>
 </enumValues>
 <enumValues>
  <name>POSCashAccount</name>
 </enumValues>
</mdclass:Enum>

IRP/src/InformationRegisters/T9011S_AccountsCashAccount/Forms/RecordForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.Items.RecordType.ChoiceList.Add("All"     , R().CLV_1);
	ThisObject.Items.RecordType.ChoiceList.Add("CashAccount" , Metadata.Catalogs.CashAccounts.ObjectPresentation);
	
	If ValueIsFilled(Record.CashAccount) Then
		ThisObject.RecordType = "CashAccount";
	Else
		ThisObject.RecordType = "All";
	EndIf;
	SetVisible();
EndProcedure

&AtClient
Procedure RecordTypeOnChange(Item)
	SetVisible();
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	If ThisObject.RecordType <> "CashAccount" Then
		CurrentObject.CashAccount = Undefined;
		CurrentObject.Currency = Undefined;
	EndIf;
EndProcedure

&AtServer
Procedure SetVisible()
	Items.CashAccount.Visible = ThisObject.RecordType = "CashAccount";
	Items.Currency.Visible = ThisObject.RecordType = "CashAccount";
	Items.AccountTransit.Visible = ThisObject.Record.CashAccount.Type <> Enums.CashAccountTypes.Transit;
EndProcedure

&AtClient
Procedure CashAccountOnChange(Item)
	If ValueIsFilled(Record.CashAccount) Then
		Record.Currency = CommonFunctionsServer.GetRefAttribute(Record.CashAccount, "Currency");
	Else
		Record.Currency = Undefined;
	EndIf;
	SetVisible();
EndProcedure
